#声明
def print_dafo():
	print("                            _ooOoo_  ")
	print("                           o8888888o  ")
	print("                           88  .  88  ")
	print("                           (| -_- |)  ")
	print("                            O\\ = /O  ")
	print("                        ____/`---'\\____  ")
	print("                      .   ' \\| |// `.  ")
	print("                       / \\||| : |||// \\  ")
	print("                     / _||||| -:- |||||- \\  ")
	print("                       | | \\\\\\ - /// | |  ")
	print("                     | \\_| ''\\---/'' | |  ")
	print("                      \\ .-\\__ `-` ___/-. /  ")
	print("                   ___`. .' /--.--\\ `. . __  ")
	print("                ."" '< `.___\\_<|>_/___.' >'"".  ")
	print("               | | : `- \\`.;`\\ _ /`;.`/ - ` : | |  ")
	print("                 \\ \\ `-. \\_ __\\ /__ _/ .-` / /  ")
	print("         ======`-.____`-.___\\_____/___.-`____.-'======  ")
	print("                            `=---='  ")
	print("  ")
	print("         .............................................  ")
	print("                  佛祖镇楼                  BUG辟易  ")
	print("          佛曰:  ")
	print("                  写字楼里写字间，写字间里程序员；  ")
	print("                  程序人员写程序，又拿程序换酒钱。  ")
	print("                  酒醒只在网上坐，酒醉还来网下眠；  ")
	print("                  酒醉酒醒日复日，网上网下年复年。  ")
	print("                  但愿老死电脑间，不愿鞠躬老板前；  ")
	print("                  奔驰宝马贵者趣，公交自行程序员。  ")
	print("                  别人笑我忒疯癫，我笑自己命太贱；  ")
	print("                  不见满街漂亮妹，哪个归得程序员？")


#调用
print_dafo()
print_dafo()
print_dafo()
print_dafo()






写一个注册函数

账号
密码
假如账号是一个正规的手机号11位 
密码是一个大于6位的字符串
就提示注册成功 否则注册失败


在一个登陆函数 只有注册成功 才能登录
账号
密码
假如账号和密码是刚才你注册的账号 ，就提示登录成功 否则 登录失败



定一个函数
每一秒打印一次 我喜欢玩游戏
在奇数的时候，
调用另一个函数打印我喜欢写代码



